Reports/Дерби.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Дерби</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выигрыш</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ничья</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проигрыш</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Лига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Лига</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Страны</xr:Item>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоКоманд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРотация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квалификация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Туры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Туры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Дерби/Ext/ObjectModule.bsl
Функция ОтчетСформировать(Отчет, Команды) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	Отчет.Данные.Очистить();
	
	Если Команды.Количество() < 2 Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	               |	ЧемпионатыКоманды.Ссылка КАК Чемпионат,
	      	               |	ЧемпионатыКоманды.Ссылка.Владелец КАК Лига
	      	               |ИЗ
	      	               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига.Команды КАК ЛигаКоманды
	      	               |		ПО ЧемпионатыКоманды.Ссылка.Владелец = ЛигаКоманды.Ссылка
	      	               |ГДЕ
	      	               |	ЧемпионатыКоманды.Команда В(&Команды)
	      	               |	И ЧемпионатыКоманды.Ссылка.ДатаНачала <= &Дата
	      	               |	И ЧемпионатыКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
	      	               |	И ЛигаКоманды.НомерСтроки = 1
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ЧемпионатыКоманды.Ссылка.ДатаОкончания УБЫВ");
	Запрос.УстановитьПараметр("Команды",		Команды);
	Запрос.УстановитьПараметр("Дата",			ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	ТабДокумент.Вывести(ЗаголовокПолучить(Выборка.Лига, Выборка.Чемпионат));
	
	Отчет.Чемпионат	= Выборка.Чемпионат;
	Запрос.УстановитьПараметр("Чемпионат",			Выборка.Чемпионат);
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ТурнирнаяТаблица.Регистратор КАК Регистратор,
	            	  |	ТурнирнаяТаблица.НомерСтроки КАК НомерСтроки,
	            	  |	ТурнирнаяТаблица.Команда КАК Команда,
	            	  |	ТурнирнаяТаблица.КоличествоГолов КАК КоличествоГолов,
	            	  |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
	            	  |ПОМЕСТИТЬ ТурнирнаяТаблица
	            	  |ИЗ
	            	  |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	            	  |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	            	  |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	            	  |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	            	  |ГДЕ
	            	  |	Туры.Владелец = &Чемпионат
	            	  |	И ТурнирнаяТаблица.Команда В(&Команды)
	            	  |	И Противник.Команда В(&Команды)
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ
	            	  |	ЧемпионатыКоманды.Команда КАК Команда,
	            	  |	СУММА(ВЫБОР
	            	  |			КОГДА ТурнирнаяТаблица.Регистратор ЕСТЬ NULL
	            	  |				ТОГДА 0
	            	  |			ИНАЧЕ 1
	            	  |		КОНЕЦ) КАК КоличествоИгр,
	            	  |	СУММА(ЕСТЬNULL(ТурнирнаяТаблица.КоличествоГолов, 0)) КАК КоличествоЗабито,
	            	  |	СУММА(ЕСТЬNULL(ТурнирнаяТаблица.КоличествоОчков, 0)) КАК КоличествоОчков,
	            	  |	СУММА(ВЫБОР
	            	  |			КОГДА ЕСТЬNULL(ТурнирнаяТаблица.КоличествоОчков, 0) > ЕСТЬNULL(Противник.КоличествоОчков, 0)
	            	  |				ТОГДА 1
	            	  |			ИНАЧЕ 0
	            	  |		КОНЕЦ) КАК Выигрыш,
	            	  |	СУММА(ВЫБОР
	            	  |			КОГДА ЕСТЬNULL(ТурнирнаяТаблица.КоличествоОчков, 0) = ЕСТЬNULL(Противник.КоличествоОчков, -1)
	            	  |				ТОГДА 1
	            	  |			ИНАЧЕ 0
	            	  |		КОНЕЦ) КАК Ничья,
	            	  |	СУММА(ВЫБОР
	            	  |			КОГДА ЕСТЬNULL(ТурнирнаяТаблица.КоличествоОчков, 0) < ЕСТЬNULL(Противник.КоличествоОчков, 0)
	            	  |				ТОГДА 1
	            	  |			ИНАЧЕ 0
	            	  |		КОНЕЦ) КАК Проигрыш,
	            	  |	СУММА(ЕСТЬNULL(Противник.КоличествоГолов, 0)) КАК КоличествоПропущено,
	            	  |	СУММА(ЕСТЬNULL(ТурнирнаяТаблица.КоличествоГолов, 0)) - СУММА(ЕСТЬNULL(Противник.КоличествоГолов, 0)) КАК Разница
	            	  |ИЗ
	            	  |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	            	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
	            	  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК Противник
	            	  |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	            	  |				И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	            	  |		ПО ЧемпионатыКоманды.Команда = ТурнирнаяТаблица.Команда
	            	  |ГДЕ
	            	  |	ЧемпионатыКоманды.Ссылка = &Чемпионат
	            	  |	И ЧемпионатыКоманды.Команда В(&Команды)
	            	  |
	            	  |СГРУППИРОВАТЬ ПО
	            	  |	ЧемпионатыКоманды.Команда
	            	  |
	            	  |УПОРЯДОЧИТЬ ПО
	            	  |	КоличествоОчков УБЫВ,
	            	  |	КоличествоИгр,
	            	  |	Разница УБЫВ,
	            	  |	КоличествоЗабито УБЫВ,
	            	  |	Команда
	            	  |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	ТабДокумент.ФиксацияСверху	= 4 + Выборка.Количество();
	
	Итого	= Новый Структура("Место,Делитель", 0, 5);
	Если ТурнирнаяТаблицаКакНаBBC() Тогда
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка1"));
		
		Пока Выборка.Следующий() Цикл
			Итого.Место	= Итого.Место + 1;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Детали1|Начало");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			СерверныйФункции.КартинкаУстановить(ОбластьМакета, Выборка.Команда);
			ОбластьМакета.Параметры.Место	= Итого.Место;
			ТабДокумент.Вывести(ОбластьМакета);
			
			Пятерка		= 1;
			Матчи = ВстречиПоследние5(Выборка.Команда, Команды, Отчет.Чемпионат);
			Для Каждого Детали Из Матчи Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Детали1|" + Детали.Результат);
				ОбластьМакета.Параметры.Заполнить(Детали);
				ТабДокумент.Присоединить(ОбластьМакета);
				Пятерка		= Пятерка + 1;
			КонецЦикла;
			Для Шаг = Пятерка По Итого.Делитель Цикл
				ТабДокумент.Присоединить(Макет.ПолучитьОбласть("Детали1|NN"));
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
		КонецЦикла;
	Иначе
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка|Основная"));
		
		ПоказыватьРазницуМячей	= ПоказыватьРазницуМячей();
		Пока Выборка.Следующий() Цикл
			Итого.Место	= Итого.Место + 1;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Детали|Основная");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			СерверныйФункции.КартинкаУстановить(ОбластьМакета, Выборка.Команда);
			ОбластьМакета.Параметры.Место	= Итого.Место;
			Если НЕ ПоказыватьРазницуМячей Тогда
				ОбластьМакета.Параметры.Разница	= СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено);
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
			
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));
	
	Хозяева			= МояКомандаПолучить();
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Матч.Дата КАК Дата,
	            	  |	Матч.Счет КАК Счет,
	            	  |	Матч.Ссылка КАК Матч,
	            	  |	ТурнирнаяТаблица.Команда = &Хозяева
	            	  |		ИЛИ Противник.Команда = &Хозяева КАК Хозяева
	            	  |ИЗ
	            	  |	Документ.Матч КАК Матч
	            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	            	  |		ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
	            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	            	  |		ПО Матч.Ссылка = Противник.Регистратор
	            	  |ГДЕ
	            	  |	Матч.Тур.Владелец = &Чемпионат
	            	  |	И ТурнирнаяТаблица.НомерСтроки = 1
	            	  |	И ТурнирнаяТаблица.Команда В(&Команды)
	            	  |	И Противник.НомерСтроки = 2
	            	  |	И Противник.Команда В(&Команды)
	            	  |
	            	  |УПОРЯДОЧИТЬ ПО
	            	  |	Дата УБЫВ,
	            	  |	Счет";
	Запрос.УстановитьПараметр("Хозяева",		Хозяева);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Область = Макет.ПолучитьОбласть(?(Выборка.Хозяева, "Хозяева", "Матчи"));
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ВстречиПоследние5(Команда, Команды, Чемпионат)
	Возврат СерверныйФункции.ВстречиПоследние5(Команда, Команды, Чемпионат);
КонецФункции

Функция ЗаголовокПолучить(Лига, Чемпионат)
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,ВыводитьЧемпионат", Лига, Чемпионат, Истина));
КонецФункции

Функция МояКомандаПолучить()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

Функция ПоказыватьРазницуМячей()
	Возврат НаСервереПовторно.ПоказыватьРазницуМячей();
КонецФункции

Функция ТурнирнаяТаблицаКакНаBBC()
	Возврат НаСервереПовторно.ТурнирнаяТаблицаКакНаBBC();
КонецФункции
